Repository: palonenlabs/Cura
Catalog: resources/locale/*/LC_MESSAGES/Cura.po
Languages: fi

source: Retract the filament when the nozzle is moving over a none-printed area. Details about the retraction can be configured in the advanced tab.
fi: Vedä filamenttia takaisinpäin kun suutin liikkuu tyhjän kohdan yli. Voit konfiguroida tämän tarkemmin tulostuksen erikoisasetuksissa.

source: Fill
fi: Täyttö

source: Bottom/Top thickness (mm)
fi: Alimman/ylimmän vahvuus (mm)

source: This controls the thickness of the bottom and top layers, the amount of solid layers put down is calculated by the layer thickness and this value. Having this value a multiple of the layer thickness makes sense. And keep it near your wall thickness to make an evenly strong part.
fi: Tämä säätää ensimmäisen ja viimeisen tulostuskerroksen vahvuutta. Täydellä täytöllä täytettyjen kerrosten lukumäärä lasketaan sekä tästä asetuksesta että kerrosvahvuudesta. On hyvä pitää tämä kerrosvahvuuden kerrannaisena. Jos haluat tasavahvan kappaleen, pidä tämä mahdollisimman lähellä seinämävahvuutta.

source: Fill Density (%)
fi: Täytön tiheys (%)

source: This controls how densely filled the insides of your print will be. For a solid part use 100%, for an empty part use 0%. A value around 20% is usually enough. This won't affect the outside of the print and only adjusts how strong the part becomes.
fi: Tästä voit asettaa kuinka paljon kappaleen sisustaa täytetään. Täysin kiinteälle kappaleelle käytä arvoa 100%. Jos haluat tulostaa vain seinämät, käytä arvoa 0%. Yleensä 20% on hyvä täyttö yleiskäyttöön. Tämä ei vaikuta kappaleen ulkopintaan vaan ainoastaan kappaleen lujuuteen.

source: The nozzle size is very important, this is used to calculate the line width of the infill, and used to calculate the amount of outside wall lines and thickness for the wall thickness you entered in the print settings.
fi: Suuttimen koko on hyvin tärkeä. Tätä käytetään sekä täytön tulostusleveyden että seinämien viivamäärän laskemiseen.

source: Speed and Temperature
fi: Nopeus ja lämpötila

source: Print speed (mm/s)
fi: Tulostusnopeus (mm/s)

source: Speed at which printing happens. A well adjusted Ultimaker can reach 150mm/s, but for good quality prints you want to print slower. Printing speed depends on a lot of factors. So you will be experimenting with optimal settings for this.
fi: Nopeus jolla tulostus tapahtuu. miniFactory3:lle hyvä alkuasetus on noin 40-50mm/s. Lopullinen nopeus on monen tekijän summa joten kannattaa kokeilla eri nopeuksia jotta saat hyvän tulosteen.

source: Printing temperature (C)
fi: Tulostuslämpötila (C)

source: Temperature used for printing. Set at 0 to pre-heat yourself. For PLA a value of 210C is usually used. For ABS a value of 230C or higher is required.
fi: Tulosteen lämpötila. Aseta 0 jos haluat esilämmittää pään itse. PLA:lle käytetään usein noin 210 C lämpötilaa. ABS:lle käytetään usein noin 230 C tai korkeampaa lämpötilaa.

source: 2nd nozzle temperature (C)
fi: 2. suuttimen lämpötila (C)

source: 3th nozzle temperature (C)
fi: 3. suuttimen lämpötila (C)

source: 4th nozzle temperature (C)
fi: 4. suuttimen lämpötila (C)

source: Bed temperature (C)
fi: Tulostusalustan lämpötila (C)

source: Temperature used for the heated printer bed. Set at 0 to pre-heat yourself.
fi: Tulostusalustan lämpötila. Aseta 0 jos haluat esilämmittää alustan itse.

source: None
fi: Ei mitään

source: Touching buildplate
fi: Tulostusalustaa koskettaviin

source: Everywhere
fi: Joka puolelle

source: Support
fi: Tuki

source: Support type
fi: Tuen tyyppi

source: Type of support structure build. "Touching buildplate" is the most commonly used support setting. None does not do any support. Touching buildplate only creates support where the support structure will touch the build platform. Everywhere creates support even on top of parts of the model.
fi: Tuen tyyppi. "Tulostusalustaa koskettaviin" on yleisin käytetty. "Ei mitään" ei lisää minkäänlaista tukea. "Tulostusalustaa koskettaviin" lisää tukea vain sinne missä tukirakenne koskettaa tulostusalustaa."Joka puolelle" lisää tuen myös vaikka tukirakenne jouduttaisiin rakentamaan kappaleen päälle.

source: Brim
fi: Reuna

source: Raft
fi: Tukilautta

source: Platform adhesion type
fi: Kiinnitys tulostusalustaan

source: Different options that help in preventing corners from lifting due to warping. Brim adds a single layer thick flat area around your object which is easy to cut off afterwards, and the recommended option. Raft adds a thick raster at below the object and a thin interface between this and your object. (Note that enabling the brim or raft disables the skirt)
fi: Eri asetuksia joilla pyritään estämään kulmien käpristyminen. "Reuna" lisää useita yhden kerroksen vahvuisia kierroksia kappaleen ympäri. Reuna on helppo leikata pois jälkeenpäin ja onkin siksi suositeltu vaihtoehto. "Lautta" lisää paksun rasterin tulostusalustan päälle ja ohuen kerroksen kappaleen ja tämän rasterin väliin. (Huomaa että tulostus aloitetaan ilman alkukierrosta sekä "reuna" että "lautta"-vaihtoehdoilla)

source: Both
fi: Molemmat

source: First extruder
fi: Ensimmäinen suutin

source: Second extruder
fi: Toinen suutin

source: Support dual extrusion
fi: Kahden suuttimen tuki

source: Which extruder to use for support material, for break-away support you can use both extruders. But if one of the materials is more expensive then the other you could select an extruder to use for support material. This causes more extruder switches. You can also use the 2nd extruder for soluble support materials.
fi: Mitä suutinta käytetään tukimateriaalille.

source: Dual extrusion
fi: Tuplasuuttimella tulostus

source: Wipe&prime tower
fi: Pyyhi ja valmistele -alue

source: The wipe-tower is a tower printed on every layer when switching between nozzles. The old nozzle is wiped off on the tower before the new nozzle is used to print the 2nd color.
fi: Pyyhintä-alue on torni joka tulostetaan jokaisella kerroksella kun vaihdetaan suutinten välillä. Vanha suutin pyyhitään pyyhintä-alueeseen ennenkuin toista suutinta käytetään.

source: Wipe&prime tower volume per layer (mm3)
fi: Pyyhintä-alueen tilavuus per kerros (mm3)

source: The amount of material put in the wipe/prime tower. This is done in volume because in general you want to extrude a certain amount of volume to get the extruder going, independent on the layer height. This means that with thinner layers, your tower gets bigger.
fi: Pyyhintä-alueella käytettävän materiaalin määrä.

source: Ooze shield
fi: Valumisen suoja

source: The ooze shield is a 1 line thick shell around the object which stands a few mm from the object. This shield catches any oozing from the unused nozzle in dual-extrusion.
fi: Valumisen suoja on yhden vedon paksuinen kuori muutaman millimetrin päässä kappaleen ympärillä. Tämä suoja estää toisen suuttimen valumisen kun käytetään kahta suutinta.

source: Filament
fi: Filamentti

source: Diameter (mm)
fi: Läpimitta (mm)

source: Diameter of your filament, as accurately as possible. If you cannot measure this value you will have to calibrate it, a higher number means less extrusion, a smaller number generates more extrusion.
fi: Filamentin paksuus, mahdollisimman tarkasti. Jos et voi mitata filamenttia, sinun täytyy hakea oikea arvo kalibroimalla tulosteita. Pienempi numero tässä aiheuttaa enemmän pursotusta ja suurempi numero vähemmän. Yleisimpiä arvoja ovat 1.75 mm ja 2.98 mm.

source: Diameter2 (mm)
fi: Läpimitta2 (mm)

source: Flow (%)
fi: Virtaus (%)

source: Flow compensation, the amount of material extruded is multiplied by this value
fi: Virtauksen kompensaatio. Pursotettavan materiaan määrä kerrotaan tällä arvolla.

source: Retraction
fi: Takaisinveto

source: Speed (mm/s)
fi: Nopeus (mm/s)

source: Speed at which the filament is retracted, a higher retraction speed works better. But a very high retraction speed can lead to filament grinding.
fi: Takaisinvedon nopeus. Yleensä nopeampi takaisinveto toimii paremmin. Liian nopea takaisinveto saattaa johtaa filamentin liialliseen kulumiseen.

source: Distance (mm)
fi: Etäisyys (mm)

source: Amount of retraction, set at 0 for no retraction at all. A value of 4.5mm seems to generate good results.
fi: Takaisinvedon määrä. Aseta 0 jos haluat ettei filamenttia vedetä lainkaan takaisin. Noin 4.5 mm näyttää antavan hyviä tuloksia.

source: Minimum travel (mm)
fi: Minimiliike (mm)

source: Minimum amount of travel needed for a retraction to happen at all. To make sure you do not get a lot of retractions in a small area.
fi: Liikkeen minimimäärä jotta takaisinvetoa tehtäisiin. Tällä voidaan estää jatkuva takaisinveto samalla pienellä alueella.

source: Minimal extrusion before retracting (mm)
fi: Pursotuksen minimimäärä ennen takaisinvetoa (mm)

source: The minimal amount of extrusion that needs to be done before retracting again if a retraction needs to happen before this minimal is reached the retraction is ignored. This avoids retraction a lot on the same piece of filament which flattens the filament and causes grinding issues.
fi: Pursotettavan materiaalin minimimäärä ennen uutta takaisinvetoa. Tällä voidaan estää jatkuva takaisinveto lähes samassa kohdassa filamenttia.

source: Initial layer thickness (mm)
fi: Ensimmäisen kerroksen vahvuus (mm)

source: Layer thickness of the bottom layer. A thicker bottom layer makes sticking to the bed easier. Set to 0.0 to have the bottom layer thickness the same as the other layers.
fi: Alimman kerroksen kerrosvahvuus. Paksumpi alin kerros auttaa kappaletta tarttumaan paremmin. Aseta 0 jos haluat että alin kerros on saman vahvuinen kuin muutkin kerrokset.

source: Cut off object bottom (mm)
fi: Alaosan leikkaus (mm)

source: Sinks the object into the platform, this can be used for objects that do not have a flat bottom and thus create a too small first layer.
fi: "Upottaa" kappaleen tulostusalustaan. Tällä voidaan leikata kappaleen alaosaa pois jotta saataisiin alaosasta tasaisisempi.

source: Travel speed (mm/s)
fi: Siirtonopeus (mm/s)

source: Speed at which travel moves are done, a high quality build Ultimaker can reach speeds of 250mm/s. But some machines might miss steps then.
fi: Nopeus jolla siirtoliikkeet tehdään. miniFactory3:lla voidaan voidaan käyttää noin 80 mm/s arvoja.

source: Bottom layer speed (mm/s)
fi: Alimman kerroksen nopeus (mm/s)

source: Print speed for the bottom layer, you want to print the first layer slower so it sticks better to the printer bed.
fi: Alimman kerroksen tulostusnopeus. Jos tulostat alimman kerroksen hieman hitaammin, se tarttuu yleensä paremmin.

source: Infill speed (mm/s)
fi: Täytön nopeus (mm/s)

source: Cool
fi: Jäähdytys

source: Minimal layer time (sec)
fi: Kerroksen minimiaika (sek)

source: Enable cooling fan
fi: Kappaleen jäähdytys

source: Enable the cooling fan during the print. The extra cooling from the cooling fan is essential during faster prints.
fi: Jäähdytä kappaletta tulostuksen ajan. Jäähdytys on tarpeellinen varsinkin nopeilla tulosteilla.

source: Line count
fi: Toistomäärä

source: Start distance (mm)
fi: Aloitusetäisyys (mm)

source: Minimal length (mm)
fi: Minimipituus (mm)

source: Infill
fi: Täyttö

source: Solid infill top
fi: Kiinteä ylin kerros

source: Create a solid top surface, if set to false the top is filled with the fill percentage. Useful for cups/vases.
fi: Luo ylin kerros täysin kiinteäksi. Jos tätä ei aseteta, yläosa täytetään täyttöprosentin mukaan. Hyödyllinen 'kuppi'/'vaasi' - tyyppisillä tulosteilla.

source: Solid infill bottom
fi: Täysin kiinteä alin kerros

source: Create a solid bottom surface, if set to false the bottom is filled with the fill percentage. Useful for buildings.
fi: Luo alin kerros täysin kiinteäksi. Jos tätä ei aseteta, alin kerros täytetään täyttöprosentin mukaan. Hyödyllinen esim. rakennuksissa.

source: Infill overlap (%)
fi: Täytön ylitys (%)

source: Amount of overlap between the infill and the walls. There is a slight overlap with the walls and the infill so the walls connect firmly to the infill.
fi: Sisäpuolen täytön ja seinämien keskinäinen ylitysmäärä. Pieni keskinäinen ylitys tarvitaan jotta reuna kiinnittyy kunnolla täyttöön.

source: Overhang angle for support (deg)
fi: Riippuvan osan täytön astekulma (astetta)

source: Fill amount (%)
fi: Täyttöaste (%)

source: Model colour
fi: Mallin väri

source: Model colour (2)
fi: Mallin väri (2)

source: Model colour (3)
fi: Mallin väri (3)

source: Model colour (4)
fi: Mallin väri (4)

source: Maximum width (mm)
fi: Maksimileveys (mm)

source: Size of the machine in mm
fi: Tulostimen koko millimetreinä

source: Maximum depth (mm)
fi: Maksimisyvyys (mm)

source: Maximum height (mm)
fi: Maksimikorkeus (mm)

source: Machine center 0,0
fi: Tulostusalustan keskikohta 0,0

source: Build area shape
fi: Tulostusalustan muoto

source: The shape of machine build area.
fi: Tulostusalustan muoto.

source: If you have an heated bed, this enabled heated bed settings (requires restart)
fi: Jos tulostimessasi on lämmitettävä alusta, tämä mahdollistaa sen ohjauksen (vaatii Curan uudelleenkäynnistämisen).

source: Serial port
fi: Sarjaportti

source: Serial port to use for communication with the printer
fi: Tulostimen kanssa käytettävä sarjaportti

source: Baudrate
fi: Baudinopeus

source: Speed of the serial port communication Needs to match your firmware settings Common values are 250000, 115200, 57600
fi: Sarjaportin nopeus. miniFactory3 käyttää 115200 nopeutta.

source: Head size towards X min (mm)
fi: Tulostuspään koko X min suunnassa (mm)

source: The head size when printing multiple objects, measured from the tip of the nozzle towards the outer part of the head. 75mm for an Ultimaker if the fan is on the left side.
fi: Tulostuspään koko jos tulostetaan montaa kappaletta, mitattuna suuttimen kärjestä uloimpaan osaan päätä.

source: Head size towards Y min (mm)
fi: Tulostuspään koko Y min suunnassa (mm)

source: The head size when printing multiple objects, measured from the tip of the nozzle towards the outer part of the head. 18mm for an Ultimaker if the fan is on the left side.
fi: Tulostuspään koko jos tulostetaan montaa kappaletta, mitattuna suuttimen kärjestä uloimpaan osaan päätä.

source: Head size towards X max (mm)
fi: Tulostuspään koko X max suunnassa (mm)

source: Head size towards Y max (mm)
fi: Tulostuspään koko Y max suunnassa (mm)

source: The head size when printing multiple objects, measured from the tip of the nozzle towards the outer part of the head. 35mm for an Ultimaker if the fan is on the left side.
fi: Tulostuspään koko jos tulostetaan montaa kappaletta, mitattuna suuttimen kärjestä uloimpaan osaan päätä.

source: Printer gantry height (mm)
fi: Hyllyn korkeus (mm)

source: The height of the gantry holding up the printer head. If an object is higher then this then you cannot print multiple objects one for one. 60mm for an Ultimaker.
fi: Tulostinpäätä ylhäällä pitävän hyllyn korkeus. Jos kappale on tätä korkeampi, et voi tulostaa montaa kappaletta samaan aikaan yksi kerrallaan.

source: Thicker layers then %.2fmm (80%% nozzle size) usually give bad results and are not recommended.
fi: Yleensä suurempi kuin %.2fmm (80%% suuttimen koko) kerrosvahvuus antaa huonoja tuloksia ja sitä ei suositella käytettäväksi.

source: It is highly unlikely that your machine can achieve a printing speed above 150mm/s
fi: On hyvin epätodennäköistä että tulostimesi voi saavuttaa yli 150mm/s tulostusnopeuden

source: Temperatures above 260C could damage your machine, be careful!
fi: Yli 260C lämpötilat voivat vahingoittaa tulostintasi - ole varovainen!

source: Are you sure your filament is that thick? Normal filament is around 3mm or 1.75mm.
fi: Oletko varma että filamenttisi on noin vahvaa ? Normaalisti filamentti on noin 3mm tai 1.75mm vahvaa.

source: It is highly unlikely that your machine can achieve a travel speed above 300mm/s
fi: On erittäin epätodennäköistä että tulostimesi pystyy yli 300mm/s nopeuksiin

source: A bottom layer of more then %.2fmm (3/4 nozzle size) usually give bad results and is not recommended.
fi: Alin kerros jonka vahvuus on yli %.2fmm (3/4 suuttimen koosta) antaa yleensä huonoja tuloksia ja sitä ei suositella käytettäväksi.
