Repository: palonenlabs/Cura
Catalog: resources/locale/*/LC_MESSAGES/Cura.po
Languages: fi

source: A new version of Cura is available, would you like to download?
fi: Uusi versio Curasta on saatavilla - päivitetäänkö ?

source: New version available
fi: Uusi versio saatavilla

source: Add new machine wizard
fi: 'Lisää uusi tulostin'-apuri

source: First time run wizard
fi: Ohjattu laitteen asennus

source: Welcome, and thanks for trying Cura!
fi: Tervetuloa ja kiitos kun valitsit Curan!

source: This wizard will help you in setting up Cura for your machine.
fi: Seuraavaksi määritellään 3D-tulostimen asetukset.

source: The following pre-defined machine profiles are available
fi: Esiasennettuina on saatavilla seuraavat profiilit

source: Note that these profiles are not guaranteed to give good results, or work at all. Extra tweaks might be required. If you find issues with the predefined profiles, or want an extra profile. Please report it at the github issue tracker.
fi: Huomaa että näiden profiilien toiminnasta ei anneta mitään takuita. Lisäkonfiguraatio saattaa olla tarpeen. Jos huomaat ongelmia esiasennetuissa profiileissa tai haluat lisää profiileita, ole hyvä ja raportoi ne Githubin issue-trackerissä.

source: Cura is now ready to be used!
fi: Cura on nyt valmiina käyttöön!

source: RepRap machines can be vastly different, so here you can set your own settings.
fi: RepRap tulostimet voivat olla hyvin erilaisia keskenään joten tässä voit asettaa omat asetuksesi.

source: Be sure to review the default profile before running it on your machine.
fi: Varmista että käyt läpi oletusprofiilin ennenkuin tulostat sillä.

source: If you like a default profile for your machine added, then make an issue on github.
fi: Jos haluat että tulostimesi lisätään oletusprofiileihin, ole hyvä ja tee siitä tapahtuma Githubin issue-trackeriin.

source: You will have to manually install Marlin or Sprinter firmware.
fi: Sinun on erikseen asennettava Marlin tai Sprinter-firmware.

source: Machine name
fi: Tulostimen nimi

source: Machine width (mm)
fi: Tulostimen leveys (mm)

source: Machine depth (mm)
fi: Tulostimen syvyys (mm)

source: Machine height (mm)
fi: Tulostimen korkeus (mm)

source: Nozzle size (mm)
fi: Suuttimen koko (mm)

source: Heated bed
fi: Lämmitetty alusta

source: Bed center is 0,0,0 (RoStock)
fi: Alustan keskipiste 0,0,0 (RoStock)

source: Select your machine
fi: Valitse tulostimesi

source: What kind of machine do you have:
fi: Millainen tulostimesi on:

source: Other (Ex: RepRap, MakerBot)
fi: Muu (esim. miniFactory, RepRap, MakerBot)

source: The collection of anonymous usage information helps with the continued improvement of Cura.
fi: Anonyyminä kerättävä käyttötieto auttaa kehittämään Cura-ohjelmistoa.

source: This does NOT submit your models online nor gathers any privacy related information.
fi: Tämä ohjelma EI lähetä 3D-mallejasi verkkoon tai kerään mitään yksityisyydensuojaa loukkaavaa tietoa.

source: Submit anonymous usage information:
fi: Lähetä käyttäjätilastointia anonyyminä:

source: For full details see: http://wiki.ultimaker.com/Cura:stats
fi: Tarkemmin voit lukea osoitteesta http://wiki.ultimaker.com/Cura:stats

source: Select upgraded parts you have
fi: Valitse päivitetyt tulostimen osat

source: To assist you in having better default settings for your Ultimaker Cura would like to know which upgrades you have in your machine.
fi: Jotta Cura voisi paremmin päätellä sopivat oletusasetukset, ole hyvä ja kerro tässä mitä päivityksiä tulostimesi sisältää.

source: Extruder drive upgrade
fi: Syöttömekanismin päivitys

source: Heated printer bed (self built)
fi: Lämmitetty alusta (itse tehty)

source: Dual extrusion (experimental)
fi: Kaksi tulostuspäätä (kokeellinen)

source: If you have an Ultimaker bought after october 2012 you will have the Extruder drive upgrade. If you do not have this upgrade, it is highly recommended to improve reliability.
fi: Jos sinulla on Ultimaker joka on ostettu lokakuun 2012 jälkeen, valitse 'Syöttömekanismin päivitys'. Jos sinulla ei vielä ole tätä päivitystä, suosittelemme harkitsemaan sitä - se nostaa tulostuksen luotettavuutta paljon.

source: This upgrade can be bought from the Ultimaker webshop or found on thingiverse as thing:26094
fi: Tämän päivityksen voit ostaa Ultimakerin verkkokaupasta tai voit ladata sen Thingiversestä id:llä thing:26094

source: Upgrade Ultimaker Firmware
fi: Päivitä Ultimaker Firmware

source: Firmware is the piece of software running directly on your 3D printer. This firmware controls the step motors, regulates the temperature and ultimately makes your printer work.
fi: Firmware on ohjelma joka sijaitsee 3D tulostimesi "sisällä". Se ohjaa mm. askelmoottoreita, lämpötilaa ja muita tarpeellisia laitteistoja. Kaikenkaikkiaan firmware vastaa tulostimesi toiminnasta.

source: The firmware shipping with new Ultimakers works, but upgrades have been made to make better prints, and make calibration easier.
fi: Firmware jolla Ultimakerit toimitetaan kyllä toimii mutta päivitysten myötä tulostuslaatu paranee ja kalibrointi helpottuu.

source: Cura requires these new features and thus your firmware will most likely need to be upgraded. You will get the chance to do so now.
fi: Cura tarvitsee näitä uusia ominaisuuksia ja siksi firmware todennäköisesti täytyy päivittää. Hetken kuluttua tarjoamme mahdollisuuden siihen.

source: Do not upgrade to this firmware if:
fi: Älä päivitä firmwarea jos:

source: * You have an older machine based on ATMega1280 (Rev 1 machine)
fi: * Sinulla on vanhempi tulostin joka pohjautuu ATMega1280-mikroprosessoriin (Rev 1 laite)

source: * Have other changes in the firmware
fi: * Olet tehnyt muita muutoksia firmwareen

source: It is a good idea to do a few sanity checks now on your Ultimaker. You can skip these if you know your machine is functional.
fi: Nyt on hyvä hetki tehdä muutamia perustarkistuksia. Voit ohittaa nämä tarkistukset jos olet varma että laitteesi toimii.

source: Run checks
fi: Aja tarkistukset

source: Skip checks
fi: Ohita tarkistukset

source: Communication:
fi: Kommunikaatio:

source: Temperature:
fi: Lämpötila:

source: Endstops:
fi: Päätyrajat:

source: Show error log
fi: Näytä virheloki

source: Connecting to machine.
fi: Kytkeydytään tulostimeen

source: Cooldown before temperature check.
fi: Jäähdytetään ennen lämpötilan tarkistusta.

source: Checking the heater and temperature sensor.
fi: Tarkistetaan lämmitin ja lämpötilamittaus.

source: Please make sure none of the endstops are pressed.
fi: Tarkista ettei rajakytkimiä ole painettu.

source: Temperature measurement FAILED!
fi: Lämpötilan tarkistus EPÄONNISTUI!

source: Head temperature: %d
fi: Pään lämpötila: %d

source: Communication State: %s
fi: Yhteyden tila: %s

source: Failed to establish connection with the printer.
fi: Kommunikaatio tulostimen kanssa epäonnistui.

source: Please press the right X endstop.
fi: Ole hyvä ja paina oikeanpuoleista X rajakytkintä.

source: Please press the left X endstop.
fi: Ole hyvä ja paina vasemmanpuoleista X rajakytkintä.

source: Please press the front Y endstop.
fi: Ole hyvä ja paina etupuolen Y rajakytkintä.

source: Please press the back Y endstop.
fi: Ole hyvä ja paina takaosan Y rajakytkintä.

source: Please press the top Z endstop.
fi: Ole hyvä ja paina yläosan Z rajakytkintä.

source: Please press the bottom Z endstop.
fi: Ole hyvä ja paina alaosan Z rajakytkintä.

source: Checkup finished
fi: Tarkistus valmis

source: Calibrating the Steps Per E requires some manual actions.
fi: E-akselin askelmäärän kalibrointi vaatii muutamia käsin tehtäviä mittauksia.

source: First remove any filament from your machine.
fi: Ensin poista kaikki filamentti tulostimesta.

source: Next put in your filament so the tip is aligned with the top of the extruder drive.
fi: Seuraavaksi laita filamentti sisään niin että filamentin kärki on linjassa syöttökoneiston kanssa.

source: We'll push the filament 100mm
fi: Syötämme filamenttia 100mm

source: Extrude 100mm filament
fi: Pursota 100mm filamenttia

source: Now measure the amount of extruded filament: (this can be more or less then 100mm)
fi: Nyt mittaa mittanauhalla pursotetun filamentin määrä (tämä voi olla enemmän tai vähemmän kuin 100mm)

source: Save
fi: Tallenna

source: This results in the following steps per E:
fi: Lopputulokseksi saatiin määrä askelia per E:

source: You can repeat these steps to get better calibration.
fi: Voit toistaa nämä toimenpiteet jotta saat tarkemman kalibroinnin.

source: If you still have filament in your printer which needs heat to remove, press the heat up button below:
fi: Jos sinulla on vielä filamenttia printterissä ja haluat poistaa sen, voit lämmittää suuttimen painamalla allaolevaa nappia:

source: Heatup for filament removal
fi: Tulostuspään lämmitys filamentin poistoa varten

source: Error: Failed to open serial port to machine If this keeps happening, try disconnecting and reconnecting the USB cable
fi: Virhe: Sarjaportin avaus epäonnistui. Jos tämä toistuu, ole hyvä ja kytke tulostin uudelleen USB-portiin.

source: Head Z offset wizard
fi: Aja tulostusalustan korkeuden säätö...

source: Printer head Z offset calibration
fi: Tulostusalustan korkeuden säätö

source: This wizard will help you in calibrating printer head Z offset.
fi: Tämä ohjattu asetustoiminto auttaa sinua määrittämään helposti suuttimen aloituskorkeuden.

source: Please make sure printer bed is clear of objects and head is clear to move.
fi: Tarkista että tulostusalusta on tyhjä ja että akselit voivat liikkua vapaasti. Aseta normaali A4-paperi tulostusalustalle.

source: Please adjust height with 'Up' and 'Down' buttons until normal A4 paper just barely moves between extruder nozzle and bed.
fi: Säädä suuttimen etäisyys tulostusalustasta 'Ylös' ja 'Alas' painikkeilla. Oikea etäisyys määritetään paperiarkin avulla. Suutin on silloin oikealla etäisyydellä tulostusalustasta kun paperi hieman hankaa suuttimeen mutta kuitenkin liikkuu edestakaisin suuttimen ja alustan välissä.

source: Connect to printer
fi: Yhdistä tulostimeen

source: Up
fi: Ylös

source: Down
fi: Alas

source: OK, extruder touches paper now
fi: OK, nyt tulostuspää koskettaa paperia

source: Done! Z calibration: %f
fi: Suuttimen aloituskorkeus on nyt asetettu. Arvoksi tallennettiin %f. Jatka painamalla "Valmis".

source: Homing printer ...
fi: Ajetaan kotiasemaan ...

source: Please adjust with Up/Down until A4 just barely moves
fi: Säädä 'Ylös'/'Alas' - painikkeilla suuttimen etäisyyttä

source: I am sorry, but Cura does not ship with a default firmware for your machine configuration.
fi: Olemme pahoillamme mutta Cura ei sisällä firmwarea tulostimellesi.

source: Firmware update
fi: Firmwaren päivitys

source: Cura only supports firmware updates for ATMega2560 based hardware. So updating your RepRap with Cura might or might not work.
fi: Cura tukee vain ATMega2560 pohjaisia tulostimia. Joten RepRap-tulostimen päivitys saattaa epäonnistua.

source: Reading firmware...
fi: Luetaan firmwarea...

source: Connecting to machine...
fi: Yhdistetään tulostimeen...

source: Please connect the printer to your computer with the USB cable.
fi: Ole hyvä ja kytke tulostin USB-kaapelilla tietokoneeseesi.

source: Failed to find machine for firmware upgrade Is your machine connected to the PC?
fi: Tulostinta ei löydy. Tarkista että tulostin on kytketty USB-kaapelilla tietokoneeseen.

source: Uploading firmware...
fi: Päivitetään firmwarea...

source: Done! Installed firmware: %s
fi: Valmis! Asennettiin firmware: %s

source: Failed to write firmware.
fi: Firmwaren kirjoitus epäonnistui.

source: Load model file... CTRL+L
fi: Lataa 3D-mallitiedosto CTRL+L

source: Save model... CTRL+S
fi: Tallenna malli... CTRL+S

source: Clear platform
fi: Tyhjennä tulostusalusta

source: Print... CTRL+P
fi: Tulosta... CTRL+P

source: Save GCode...
fi: Tallenna G-koodi...

source: Show slice engine log...
fi: Näytä laskentamoottorin loki

source: Open Profile...
fi: Avaa profiili...

source: Save Profile...
fi: Tallenna profiili...

source: Load Profile from GCode...
fi: Lataa profiili G-koodista...

source: Reset Profile to default
fi: Nollaa profiili oletukseksi

source: Preferences... CTRL+,
fi: Asetukset... CTRL+,

source: Machine settings...
fi: Tulostimen asetukset...

source: Recent Model Files
fi: Viimeisimmät 3D-mallit

source: Recent Profile Files
fi: Viimeisimmät profiilit

source: Quit
fi: Poistu

source: File
fi: Tiedosto

source: Minecraft map import...
fi: Minecraft kartan tuonti...

source: PID Debugger...
fi: PID avustaja...

source: Copy profile to clipboard
fi: Tallenna profiili leikepöydälle

source: Print all at once
fi: Tulosta kaikki kerralla

source: Print one at a time
fi: Tulosta yksi kerrallaan

source: Tools
fi: Työkalut

source: Machine
fi: Tulostin

source: Switch to quickprint...
fi: Näytä suppeat tulostusasetukset...

source: Switch to full settings...
fi: Näytä laajat tulostusasetukset...

source: Open expert settings... CTRL+E
fi: Tulostuksen erikoisasetukset CTRL+E

source: Run first run wizard...
fi: Ohjattu laitteen asentaminen...

source: Run bed leveling wizard...
fi: Avusta alustan tasauksessa...

source: Run head offset wizard...
fi: Aja tulostuspään offset-apuri...

source: Run head Z offset wizard...
fi: Ohjattu suuttimen aloituskorkeuden asetus...

source: Expert
fi: Asetukset

source: Online documentation...
fi: On-line dokumentaatio

source: Report a problem...
fi: Raportoi ongelma...

source: Check for update...
fi: Tarkista onko päivityksiä saatavilla...

source: Open YouMagine website...
fi: Avaa YouMagine web-sivu...

source: About Cura...
fi: Tietoa Curasta...

source: Help
fi: Ohje

source: For "One at a time" printing, you need to have entered the correct head size and gantry height in the machine settings
fi: Huomaa että "Yksi kerrallaan" tulostusta varten sinun täytyy asettaa tulostuspään tarkat mitat laiteasetuksissa

source: One at a time warning
fi: Yksi kerrallaan - varoitus

source: Install default firmware...
fi: Asenna oletusfirmware...

source: Install custom firmware...
fi: Asenna muokattu firmware...

source: Select profile file to load
fi: Valitse ladattava profiilitiedosto

source: Select gcode file to load profile from
fi: Valitse G-kooditiedosto josta haluat ladata profiilin

source: No profile found in GCode file. This feature only works with GCode files made by Cura 12.07 or newer.
fi: Profiilia ei löydetty G-kooditiedostosta. Tämä toiminto toimii vain niiden G-kooditiedostojen kanssa jotka on luotu Cura 12.07 tai uudemmilla versioilla.

source: Profile load error
fi: Profiilin latausvirhe

source: Select profile file to save
fi: Valitse profiilitiedosto tallennusta varten

source: This will reset all profile settings to defaults. Unless you have saved your current profile, all settings will be lost! Do you really want to reset?
fi: Tämä asettaa kaikki profiiliasetukset oletusasetuksiksi. Ellet ole tallentanut nykyistä profiiliasi, menetätä asetuksesi! Haluatko varmasti nollata asetukset?

source: Profile reset
fi: Profiilin nollaus

source: Warning: Installing a custom firmware does not guarantee that you machine will function correctly, and could damage your machine.
fi: Varoitus: Muokatun firmwaren asentaminen saattaa vahingoittaa tulostintasi ja ei voida antaa takuuta siitä että tulostin toimisi päivityksen jälkeen.

source: Open firmware to upload
fi: Avaa ladattava firmware

source: You are running the latest version of Cura!
fi: Käytät viimeisintä Curan versiota!

source: Awesome!
fi: Mahtavaa!

source: Basic
fi: Perusasetukset

source: Advanced
fi: Muut asetukset

source: Plugins
fi: Lisäosat

source: Start/End-GCode
fi: Työstökoodit

source: Plugins:
fi: Lisäosat:

source: Open plugin location
fi: Avaa lisäosien sijainti

source: Enabled plugins
fi: Käytössä olevat lisäosat

source: You need to select a plugin before you can add anything.
fi: Valitse lisäosa ennenkuin yrität lisätä

source: Error: no plugin selected
fi: Virhe: Ei lisäosaa valittuna

source: Colours
fi: Värit

source: Language
fi: Kieli

source: Filament settings
fi: Filamentin asetukset

source: Cura settings
fi: Curan asetukset

source: Machine settings
fi: Tulostimen asetukset

source: Printer head size
fi: Tulostuspään koko

source: Extruder %d
fi: Suutin %d

source: Communication settings
fi: Yhteysasetukset

source: Cannot remove the last machine configuration in Cura
fi: Ei voida poistaa viimeistä tulostuskonfiguraatiota Curasta

source: Machine remove error
fi: Tulostuskonfiguraation poistovirhe

source: Printing
fi: Tulostaa

source: Statistics
fi: Tilastoja

source: Your computer is running on battery power. Connect your computer to AC power or your print might not finish.
fi: Tietokoneesi käyttää akkusähköä. Kytke tietokone verkkovirtaan tai vaarana on tulostuksen keskeytyminen.

source: Filament: ####.##m #.##g Estimated print time: #####:## Machine state: Detecting baudrateXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
fi: Filamentti: ####.##m #.##g Arvioitu tulostusaika: #####:## Tulostimen tila: Tutkitaan tiedonsiirron nopeuttaXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

source: Connect
fi: Yhdistä

source: Print
fi: Tulosta

source: Pause
fi: Keskeytä

source: Cancel print
fi: Peruuta tulostus

source: Error log
fi: Virheloki

source: BedTemp:
fi: Alustan lämpötila:

source: Temp:
fi: Lämpötila:

source: Jog
fi: Askella

source: Outer wall:
fi: Uloin seinämä:

source: Inner wall:
fi: Sisäseinämä:

source: Fill:
fi: Täyttö:

source: Support:
fi: Tuki:

source: Speed
fi: Nopeus

source: Term
fi: Konsoli

source: Enable timelapse movie recording
fi: Ota intervallikuvia videota varten

source: Show preview
fi: Näytä esikatselu

source: Camera
fi: Kamera

source: Resume
fi: Jatka

source: Loading gcode...
fi: Ladataan G-koodia...

source: Filament: %(amount).2fm %(weight).2fg
fi: Filamentti: %(amount).2fm %(weight).2fg

source: Filament cost: %s
fi: Filamentin hinta: %s

source: Load
fi: Lataa

source: Rotate
fi: Käännä

source: Scale
fi: Skaalaa

source: Mirror
fi: Peilaa

source: Reset
fi: Resetoi

source: Lay flat
fi: Aseta tasaiseksi

source: To max
fi: Maksimiin

source: Mirror X
fi: Peilaa X

source: Mirror Y
fi: Peilaa Y

source: Mirror Z
fi: Peilaa Z

source: Scale X
fi: Skaalaa X

source: Scale Y
fi: Skaalaa Y

source: Scale Z
fi: Skaalaa Z

source: Size X (mm)
fi: Koko X (mm)

source: Size Y (mm)
fi: Koko Y (mm)

source: Size Z (mm)
fi: Koko Z (mm)

source: Uniform scale
fi: Yhtenäinen skaalaus

source: View mode
fi: Näyttötila

source: Normal
fi: Normaali

source: Overhang
fi: Ulkonemat

source: Transparent
fi: Läpinäkyvä

source: X-Ray
fi: Röntgen

source: Layers
fi: Tasot

source: Share on YouMagine
fi: Jaa YouMaginessa

source: Open 3D model
fi: Avaa 3D malli

source: Save 3D model
fi: Tallenna 3D malli

source: Print with %s
fi: Tulosta %s:lla

source: Slice engine log...
fi: Tulostusmoottorin loki...

source: Save toolpath
fi: Tallenna työstörata

source: The slicing engine reported the following
fi: Tulostusmoottori raportoi seuraavaa

source: Engine log...
fi: Moottorin loki:

source: How many copies do you want?
fi: Montako kopiota haluat?

source: Number of copies
fi: Kopioiden määrä

source: Multiply
fi: Monista

source: Center on platform
fi: Keskitä tulostusalustalle

source: Delete object
fi: Poista kappale

source: Multiply object
fi: Monista kappale

source: Split object into parts
fi: Jaa kappale osiin

source: Dual extrusion merge
fi: Monen tulostuspään yhdistäminen

source: Delete all objects
fi: Poista kaikki kappaleet

source: Toolpath to SD
fi: Työstörata SD-kortille

source: Overhang view not working due to lack of OpenGL shaders support.
fi: Roikkuvien kohtien näyttö ei toimi koska OpenGL ei tue varjostusta.

source: High quality print
fi: Korkealaatuinen tulostus

source: Normal quality print
fi: Normaalilaatuinen tulostus

source: Fast low quality print
fi: Nopea, heikkolaatuinen tulostus

source: Thin walled cup or vase
fi: Ohutseinämäinen kappale

source: Print support structure
fi: Tulosta tukirakenne

source: Select a quickprint profile:
fi: Valitse pikatulostuksen profiili:

source: Material:
fi: Materiaali:

source: Diameter:
fi: Vahvuus:

source: Other:
fi: Muu:

source: Exterior Only
fi: Vain ulkopuoli

source: Height (mm)
fi: Korkeus (mm)

source: Base (mm)
fi: Alusta (mm)

source: Width (mm)
fi: Leveys (mm)

source: Depth (mm)
fi: Syvyys (mm)

source: Checking token
fi: Tarkistetaan avainta

source: Failed to contact YouMagine.com
fi: YouMagine.com yhteys epäonnistui

source: YouMagine error.
fi: YouMagine virhe.

source: Cura is now authorized to share on YouMagine
fi: Curan ei ole sallittu jakaa sisältöä YouMaginessa.

source: Creating new design on YouMagine...
fi: Luodaan uutta mallia YouMagineen...

source: Failed to create a design, nothing uploaded!
fi: Mallin lataus epäonnistui, mitään ei ladattu!

source: Building model %s...
fi: Rakennan mallia %s...

source: Uploading model %s...
fi: Lataan mallia %s...

source: Failed to upload %s!
fi: Mallin %s epäonnistui!

source: Uploading file %s...
fi: Ladataan tiedostoa %s...

source: Uploading image %s...
fi: Ladataan kuvaa %s...

source: Failed to upload snapshot!
fi: Kuvan lataus epäonnistui!

source: Publishing design...
fi: Julkaisen mallia...

source: Request authorization from YouMagine
fi: Pyydä todennusta YouMaginelta

source: Paste token here
fi: Kopioi todennusavain tähän

source: To share your designs on YouMagine you need an account on YouMagine.com and authorize Cura to access your account.
fi: Ladataksesi malleja YouMagineen tarvitset YouMagine käyttäjätunnuksen. Tämän lisäksi sinun täytyy sallia Curalle pääsy YouMagineen.

source: This will open a browser window where you can authorize Cura to access your YouMagine account. You can revoke access at any time from YouMagine.com
fi: Tämä avaa selaimeen ikkunan jossa voit antaa Curalle luvan käyttää YouMagine tunnustasi. Voit koska tahansa peruuttaa luvan YouMagine.com:ssa.

source: Design name
fi: Mallin nimi

source: Publish after upload
fi: Julkaise latauksen jälkeen

source: Share!
fi: Jaa!

source: Add...
fi: Lisää...

source: Webcam...
fi: Kamera...

source: Directly publish the design after uploading. Without this check the design will not be public until you publish it yourself on YouMagine.com
fi: Julkaise malli heti latauksen jälkeen.

source: Design name:
fi: Mallin nimi:

source: Description:
fi: Kommentti:

source: Category:
fi: Kategoria:

source: License:
fi: Lisenssi:

source: Images:
fi: Kuvat:

source: Related design files:
fi: Mallitiedostot:

source: The name cannot be empty
fi: Nimi ei voi olla tyhjä

source: New design error.
fi: Mallivirhe uudessa mallissa.

source: The description cannot be empty
fi: Selite ei voi olla tyhjä

source: No webcam found on your system
fi: Kameraa ei löydetty

source: Webcam error
fi: Kameravirhe

source: An error has occurred during the 3D view drawing.
fi: 3D näkymää ladattessa tapahtui virhe

source: 3D window error
fi: 3D ikkunan virhe

source: Quality
fi: Laatu

source: Layer height (mm)
fi: Kerrosvahvuus (mm)

source: Layer height in millimeters. This is the most important setting to determine the quality of your print. Normal quality prints are 0.1mm, high quality is 0.06mm. You can go up to 0.25mm with an Ultimaker for very fast prints at low quality.
fi: Kerrosvahvuus millimetreinä. Tämä on kaikkein tärkein tulostustarkkuuteen vaikuttava tekijä. Normaalitarkkuus on noin 0.1mm, korkea laatu on noin 0.06mm. Voit mennä aina 0.25 mm vahvuuteen saakka, tällöin tulostus on nopea mutta laatu on huonompaa.

source: Shell thickness (mm)
fi: Kuorivahvuus (mm)

source: Thickness of the outside shell in the horizontal direction. This is used in combination with the nozzle size to define the number of perimeter lines and the thickness of those perimeter lines.
fi: Uloimman kuoren vahvuus (vaakasuunnassa). Tätä käytetään tulostuspään koon kanssa

source: Enable retraction
fi: Takaisinveto päälle
